Autodesk.Revit.DB.Structure.RebarCouplerError.ArcToStraightSegment
Cannot connect by coupler a straight segment with an arc segment.

Autodesk.Revit.DB.Structure.RebarCouplerError.ArcsHaveDifferentCenters
Cannot place rebar couplers on arcs with different centers.

Autodesk.Revit.DB.Structure.RebarCouplerError.ArcsHaveDifferentRadii
Cannot place rebar couplers on arcs with different radii.